app/controllers/application_controller.rb

INSERT INTO "parking_spots" ("number", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", 1], ["status", "asd"], ["created_at", "2023-12-01 17:05:02.649791"], ["updated_at", "2023-12-01 17:05:02.649791"]]
---
    def create
      @parking_spot = ParkingSpot.new(parking_spot_params)
      if @parking_spot.save