app/controllers/parking_spots_controller.rb

  def index
    @parking_spots = ParkingSpot.all
---
SELECT "parking_spots".* FROM "parking_spots"

  def create
    @new_parking_spot = ParkingSpot.new(parking_spot_params)

    if @new_parking_spot.save
---
INSERT INTO "parking_spots" ("number", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["number", 1], ["status", "asd"], ["created_at", "2023-12-01 17:05:02.649791"], ["updated_at", "2023-12-01 17:05:02.649791"]]

  def destroy
    @new_parking_spot.destroy
---
DELETE FROM "parking_spots" WHERE "parking_spots"."id" = ?  [["id", 1]]

  def set_parking_spot
    @new_parking_spot = ParkingSpot.find(params[:id])
---
SELECT  "parking_spots".* FROM "parking_spots" WHERE "parking_spots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]