app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
  def index
    @vehicles = Vehicle.all

INSERT INTO "vehicles" ("plate", "color", "model", "created_at", "updated_at", "responsavel_name") VALUES (?, ?, ?, ?, ?, ?)  [["plate", ""], ["color", ""], ["model", ""], ["created_at", "2023-12-01 18:24:23.184084"], ["updated_at", "2023-12-01 18:24:23.184084"], ["responsavel_name", ""]]
---
  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save

DELETE FROM "vehicles" WHERE "vehicles"."id" = ?  [["id", 2]]
---
  def destroy
    @vehicle.destroy

SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_vehicle
    @vehicle = Vehicle.find(params[:id])